import * as React from "react";
import { Select } from "antd";

const { Option } = Select;

const SAMPLES = {
  //3866 - Иргэний эрхийг хэрэгжүүлэх, хамгаалах онол практик
  //page 8
  y1:
    "Гэхдээ энэхүү үүргийн гүйцэтгэл нь харилцааныхаа онцлогоос хамаарч хоёр талтай.",
  //page 9
  y2:
    "Хууль зүйн шинжлэх ухаанд зарчим гэж аливаа этгээдийн үйл ажиллагаандаа баримтлах үзэл баримтлалыг хэлдэг.",
  //page 9
  y3:
    "Тэгвэл субъектив эрхийг хэрэгжүүлэхэд баримтлах зарчим гэж тухайн эрхийг хэрэгжүүлэхдээ баримтлах үзэл баримтлалыг хэлнэ.",
  //page 10
  y4:
    "Мөн Оросын Холбооны улсад хэрэв ёс суртахууны хэм хэмжээг зөрчсөн зөрчил гаргагчтай гэр бүлийн гишүүд нь хамтран амьдрах боломжгүй нөхцөл байдлыг бүрдүүлсэн бол түүнийг орон сууцнаас нь нүүлгэн гаргах үндэслэл болно гэж ОХУ-ын Орон сууцны тухай хуулийн 98-р зүйлд заасан байна.",
  //3986 Торгох ял эдлүүлэх ажиллагааны эрх зүйн зохицуулалтыг боловсронгуй болгох зарим асуудал
  //page 4
  y5:
    "Энэхүү судалгааны ажилд диаликтикийн аргыг иш үндэс болгон хүний танин мэдэхүйн шинжлэх ухааны нийтлэг аргууд болох анализ, синтез, харьцуулах, түүхчлэх, статистик боловсруулалтын арга, эрх зүйн харьцуулсан судалгаа хийх зэрэг аргыг өргөн ашиглав.",
  //page 28
  y6:
    "Торгох ял оногдуулсан шүүхийн шийтгэх тогтоол гарснаас хойш ялтан 7 хоногийн дотор шийдвэрийг сайн дураар биелүүлэх үүрэгтэй байдаг ба ялтан энэ хугацаанд торгуулийн мөнгийг төлөөгүй тохиолдолд шүүгч шийтгэх тогтоолыг ялтны оршин суугаа буюу ажиллаж байгаа, эсхүл эд хөрөнгө нь байгаа газрын шийдвэр гүйцэтгэх албанд 3 хоногийн дотор хүргүүлнэ.",
  //page 60
  y7:
    "-2011 оны торгох ялын биелэлт: Нийт 307 гүйцэтгэх хуудасны 232 нь буюу 52.8% нь бодитой биелсэн. Биелүүлбэл зохих мөнгөн дүн 1646440.4, бодитой биелүүлсэн мөнгөн дүн -1037834.1, биелэлтийн хувь -75.6%, биелэгдээгүй үлдсэн мөнгөн дүн 608606.3",
  //4110/3869 Монгол дахь хүүхдийн хөдөлмөр эрхлэлтийн тулгамдсан зарим асуудлууд
  //page 2
  y8:
    "Манай оронд сүүлийн жилүүдэд хөдөлмөр эрхэлж байгаа хүүхдийн тоо жил ирэх тусам өсөн нэмэгдэж байгаа төдийгүй тэдгээрийн эрхэлж байгаа хөдөлмөр нь шинж чанарын хувьд хүнд, аюултай, хортой гэх мэт хэлбэрүүдээр илэрч байна.",
  //page 43
  y9:
    "Монгол улсын хөдөлмөрийн тухай хуулинд заасны дагуу хүүхдийг үр бүтээлтэй ажиллуулж, тэдний эрүүл мэнд, бие бялдарын өсөлтөнд муугаар нөлөөлөхгүй хөдөлмөрлөх суралцах явдлыг зохистой хослуулан хэрэгжүүлэхэд анхаарч байгаа ажил олгогч этгээдүүдийн үйл ажиллагагаг урамшуулан дэмжих /жишээ нь татварын гэх мэт эдийн засаг нийгмийн талаас нь/",
  n1:
    "“Токио 2020” зуны олимп эхлэхэд жил хүрэхгүй хугацаа үлдлээ. Энэ наадамд оролцох манай баг тамирчдын ёслолын хувцасны загварыг өнөөдөр танилцууллаа.",
  n2:
    "Токио 2020 зуны олимпийн наадамд оролцох Монголын үндэсний шигшээ багийн ёслолын болон спортын хувцас, дагалдах хэрэгслийн загвар сонгон шалгаруулах уралдааныг Боловсрол Шинжлэх Ухаан Спортын Яамнаас зарласан юм.",
  n3:
    "Монголын Үндэсний шигшээ багийн тамирчдын спортын хувцасны загварт  Michel&Amazonka брэнд түрүүлсэн."
};

interface IProps {
  addText: (text: string) => void;
}

const InputTemplate = (props: IProps) => {
  const handleChange = (value: any) => {
    props.addText((SAMPLES as any)[value]);
  };

  return (
    <Select
      style={{ width: 180 }}
      onChange={handleChange}
      placeholder="Жишээ текст"
    >
      <Option value="y1">Хуулбартай - 1</Option>
      <Option value="y2">Хуулбартай - 2</Option>
      <Option value="y3">Хуулбартай - 3</Option>
      <Option value="y4">Хуулбартай - 4</Option>
      <Option value="y5">Хуулбартай - 5</Option>
      <Option value="y6">Хуулбартай - 6</Option>
      <Option value="y7">Хуулбартай - 7</Option>
      <Option value="y8">Хуулбартай - 8</Option>
      <Option value="y9">Хуулбартай - 9</Option>
      <Option value="n1">Хуулбаргүй-1</Option>
      <Option value="n2">Хуулбаргүй-2</Option>
      <Option value="n3">Хуулбаргүй-3</Option>
    </Select>
  );
};

export default InputTemplate;
