import * as React from "react";
import Head from "next/head";
// components
import withLayout from "~/components/Layout";
import { Row, Col } from "antd";
import Container from "~/components/Container";

const Terms = () => (
  <Container>
    <Head>
      <title>Үйлчилгээний нөхцөл</title>
    </Head>
    <Row type="flex" style={{ width: "80%" }}>
      <Col>
        <h2
          style={{ marginTop: "50px", fontWeight: "bold", textAlign: "center" }}
        >
          Үйлчилгээний нөхцөл
        </h2>
        <div className="wpb_wrapper">
          <div className="divider-wrap" data-alignment="default">
            <div style={{ height: "30px" }} className="divider"></div>
          </div>
          <div className="wpb_text_column wpb_content_element ">
            <div className="wpb_wrapper">
              <p>Сүүлийн шинэчлэл: 2019 оны 12 сарын 24</p>
              <h3>
                <strong>1. Ерөнхий зүйл</strong>
              </h3>
              <p>
                <strong>&nbsp;</strong>1.1 Та “ESAN мэдлэг мэдээллийн цахим
                сан”-(цаашид “<strong>ESAN</strong>” эсвэл “<strong>бид</strong>
                ” гэх)-ийн хэрэглэгч болохын урьд тус Үйлчилгээний нөхцөлтэй
                сайтар танилцаж, Үйлчилгээний нөхцлийг хүлээн зөвшөөрч,
                баталгаажуулсны үндсэн дээр үйлчилгээ авах эрх үүснэ.
              </p>
              <p>
                1.2 Энэхүү Үйлчилгээний нөхцөл нь хэрэглэгч та болон Степпелинк
                ХХК-ийн хооронд байгуулсан гэрээ бөгөөд ESAN-аас төрөл бүрийн
                хөдөлгөөнт хэрэгсэл болон бусад төхөөрөмж ашиглан номын сангаар
                үйлчлүүлэх, ном, сэтгүүл, эрдмийн ажил зэрэг бүтээлийг (цаашид “
                <strong>Контент</strong>” гэх) унших, худалдан авах, контент
                нийлүүлэх, хуулбар шалгах (цаашид “<strong>Үйлчилгээ</strong>”
                гэх) тай холбоотой үүсэх харилцааг зохицуулна.
              </p>
              <p>
                1.3 ESAN нь хэрэглэгчид тус Үйчилгээний нөхцөлийн 1.1-д заасан
                Үйлчилгээг зөвхөн цахим хэлбэрээр үзүүлэх байнгын ажиллагаатай
                платформ байна.
              </p>
              <p>
                1.4 ESAN мэдлэг мэдээллийн цахим сан” барааны тэмдэгт нь
                СТЕППЕЛИНК ХХК-ийн өмч байх бөгөөд энэхүү платформын лого, нэр,
                загварыг хуулах, олшруулах, дуурайх, үл мэдэгдэм өөрчлөлттэйгээр
                дуурайх, өөр бусад ямар нэгэн хэлбэрээр зөвшөөрөлгүй ашиглахыг
                хориглоно.
              </p>
              <p>
                1.5 Тус Үйлчилгээний нөхцөлийн хэрэгжилтэнд ESAN болон хэрэглэгч
                тал хамтран хяналт тавина.
              </p>
              <h3>
                <strong>2. Бүртгэл</strong>
              </h3>
              <p>
                2.1 ESAN-ийн хэрэглэгчид үйлчилгээ авахдаа “ESAN-ийн хэрэглэгч”
                болон бүртгүүлэх ба бүртгэл сайн дурын үндсэн дээр хийгдэнэ.
              </p>
              <p>
                2.2 Хэрэглэгч нь бүртгүүлэхдээ шаардлагатай бүх мэдээллийг үнэн
                зөв, бүрэн оруулах ёстой бөгөөд цаг үргэлж шинэчилж, мэдээллийн
                үнэн зөв, бодит байдал болон хэрэглэгчийн нэр, нууц үг зэргийн
                хамгаалалтанд хэрэглэгч өөрөө бүрэн хариуцлага хүлээнэ.
              </p>
              <p>
                2.3 Хэрэв та 1601 S. California Ave, Palo Alto, CA 94304, USA
                хаягтай Facebook Inc. Корпорацийн (цаашид “
                <strong>Facebook</strong>” гэх) ажиллуулдаг Facebook платфорыг
                ашиглан өөрийн Facebook-ийн бүртгэлээр ESAN-ийн хэрэглэгч
                болохыг сонговол (цаашид “<strong>Facebook Connect</strong>”
                гэх) та биднийг Facebook-ийн бүртгэлээрээ дамжуулан хэрэглэгчийн
                нэр, кодолсон нэвтрэх мэдээлэл болон бусад мэдээллийг (таны нэр,
                профайл зураг, улс, төрсөн хот, цахим шуудангийн хаяг, төрсөн
                огноо, хүйс, найз нөхөд, сүлжээний нэр зэрэг)-ийг цуглуулахыг
                зөвшөөрсөн гэж үзнэ.
              </p>
              <p>
                2.4 Хэрэглэгч Facebook Connect-ийг ашиглахад Facebook-
                бүртгэлийн мэдээлэл хамгаалах бодлого, ашиглах нөхцөлийг
                баримтална. Facebook Connect-ийг ашигласнаар хэрэглэгч нь
                Facebook бүртгэлээс ESAN руу Facebook бүртгэлийн мэдээлэл, мөн
                ESAN-г ашиглан Facebook рүү ESAN-ийн хэрэглэгчийн мэдээлэл
                дамжуулах зөвшөөрөл олгож байгаа болно.
              </p>
              <p>
                2.5 Нэг ESAN-ийн хэрэглэгч нь зөвхөн нэг л имэйл хаягаар эсвэл
                Facebook-ийн бүртгэлээр гишүүн болох эрхтэй. Ашиглагдсан имэйл
                хаяг, Facebook-ийн бүртгэл нь дахин өөр ESAN-ийн хэрэглэгчид
                ашиглагдахгүй.
              </p>
              <p>
                2.6 Шинээр бүртгүүлж ESAN-ийн хэрэглэгч болмогц тухайн гишүүнд
                бүртгэл үүснэ. Бүртгэлийн дагуу ESAN-ийн хэрэглэгчийн хувийн
                мэдээлэл, худалдан авалтын түүх зэрэг мэдээлэл хадгалагдах ба
                ESAN-ийн хэрэглэгчийн банкны төлбөрийн картын эсвэл нууц үгний
                ямар ч мэдээлэл хадгалагдахгүй.
              </p>
              <h3>
                <strong>3. Зохиогчийн эрхийн хамгаалалт</strong>
              </h3>
              <p>
                3.1 ESAN-д нийтлэгдсэн контентууд нь зөвхөн тухайн контентын
                зохиогчийн оюуны өмч бөгөөд тухайн зохиогч нь уг контентын хувьд
                зохиогчийн онцгой эрх эдлэнэ.
              </p>
              <p>
                3.2 ESAN мэдлэг, мэдэллийн цахим сан, түүний програм, код, бүтэц
                нь СТЕППЕЛИНК ХХК-ийн оюуны өмч болно
              </p>
              <p>
                3.3 Бид хэрэглэгч танд үйлчилгээ үзүүлснээрээ аливаа контент,
                түүний программ, дизайныг бүхэлд нь эсвэл аливаа нэг хэсгийг
                хуулбарлах, түгээх, орчуулах, өөр хэлбэрээр үүсмэл бүтээл болгон
                өөрчлөх, нийтлэх, дамжуулах, үзүүлэх,&nbsp; арилжааны зорилгоор
                ашиглах, гуравдагч этгээдэд дамжуулах, түрээслэх, зээлдүүлэх,
                нийтэд дэлгэж үзүүлэх аливаа онцгой эрхийг олгоогүй,
                шилжүүлээгүй, зөвшөөрөгүй болно.
              </p>
              <p>
                3.4 Хэрэглэгч нь тухайн контентыг ESAN-ийн аливаа үйлчилгээгээр
                дамжуулан өмчлөх эрхтэй болохгүй бөгөөд ESAN сан доторх аливаа
                контентыг өөрчлөх, хуулбарлах, тараах болон худалдахыг хатуу
                хориглоно.
              </p>
              <p>
                3.5 Хэрэглэгч нь ESAN-ийн контентыг зөвхөн Монгол Улсын
                Зохиогчийн эрх болон түүнд хамаарах эрхийн тухай хуульд заасан
                хүрээнд амины буюу хувийн хэрэгцээнд зориулан хязгаартайгаар
                ашиглах, ишлэх, хэсэгчлэн хуулбарлаж болох бөгөөд эх сурважлийг
                заавал дурдсан байна.
              </p>
              <p>
                3.6 Хэрэглэгч нь энэхүү Үйлчилгээний нөхцөл болон Монгол Улсын
                Зохиогчийн эрх болон түүнд хамаарах эрхийн тухай хуульд заасныг
                зөрчин ESAN-ийн контентыг хуулбарлан борлуулсан, дамжуулсан,
                түгээсэн, өөрчилсөн, ашигласан, түрээслэсэн, зээлдүүлсэн, нийтэд
                дэлгэж үзүүлсэн бол зохиогчийн эрхийг зөрчсөнөөс үүсэх
                хариуцлагыг бүрэн хүлээнэ.
              </p>
              <p>
                3.7 ESAN нь контент, мэдээллийг зөвхөн дамжуулах талбар болохын
                хувьд цахим ном, сэтгүүл, эрдмийн ажилд орсон үзэл баримтлал,
                бодлого, зөвлөгөө, үйлчилгээ, санал зэрэг контентын агуулгад
                редакцийн хяналт тавьдаггүй бөгөөд агуулга нь тухайн зохиогч(ид)
                буюу хэвлэлийн газар (ууд)-ынх тул тухайн контент доторх
                мэдээлэл, баримтын үнэн зөв, найдвартай байдлыг болон тэдгээрээс
                болж учирсан аливаа хохирол, гэм хорыг ESAN хариуцахгүй.
              </p>
              <p>
                3.8 ESAN нь аливаа контент болон хэрэглэгчийн мэдээллийг хууль
                бусаар болон зөвшөөрөлгүйгээр гуравдагч талд алдах, устгах,
                нэвтрэх, өөрчлөх, нийтэд түгээхээс сэргийлж техникийн болон
                менежментийн хамгаалалтын арга хэмжээнүүд авч ажилладаг ба
                тогтмол хяналтаас үл хамааран учирч болох бүх аюул, цахим
                халдлагаас бүрэн хамгаалах нь боломжгүй зүйл гэдгийг тус гэрээг
                байгуулагч талууд ойлгож зөвшөөрсөн болно.
              </p>
              <h3>
                <strong>4. Төлбөр тооцоо</strong>
              </h3>
              <p>
                <strong>&nbsp;</strong>4.1 ESAN-д бүртгэлтэй бүх хэрэглэгчид
                “Үнэгүй” төрөлд хамаарах контентыг хязгааргүй хандаж, үзэх
                эрхтэй.
              </p>
              <p>
                4.2 Гишүүнчлэлийн суурь хураамжаа төлж, эрхээ баталгаажуулсан
                хэрэглэгчид “Үнэгүй” төрөлд хамаарах бүх контентуудыг болон
                “Гишүүнчлэл” төрөлд хамаарах контентуудыг ашиглах эрхтэй.
                Гишүүнчлэлийн эрхийн сарын суурь хураамжийг сараар, улирлаар,
                хагас жилээр болон нэг жилээр төлж, хугацаанаас хамаарсан
                төлбөрийн хөнгөлөлт эдлэх боломжтой.
              </p>
              <table style={{ width: "622px" }}>
                <tbody style={{ border: "1px solid" }}>
                  <tr>
                    <td>Гишүүнчлэлийн багц</td>
                    <td>Төлбөр</td>
                    <td>Нэвтрэх эрхийн хугацаа</td>
                  </tr>
                  <tr>
                    <td>Сар</td>
                    <td>5,000 төг</td>
                    <td>30 хоног</td>
                  </tr>
                  <tr>
                    <td>Улирал</td>
                    <td>13,000 төг</td>
                    <td>3 сар</td>
                  </tr>
                  <tr>
                    <td>Хагас жил</td>
                    <td>25,000 төг</td>
                    <td>6 сар</td>
                  </tr>
                  <tr>
                    <td>Бүтэн жил</td>
                    <td>48,000 төг</td>
                    <td>12 сар</td>
                  </tr>
                </tbody>
              </table>
              <p style={{ marginTop: "10px" }}>
                4.3 ESAN нь “Багцын” болон “Төлбөртэй” төрөлд хамаарах
                контентуудыг Контент нийлүүлэгчийн тогтоосон үнээр хэрэглэгчид
                хүргэнэ. Хэрэглэгч “Багцын” болон “Төлбөртэй” контентыг худалдан
                авч хандах, үзэх, унших эрхтэй болно.
              </p>
              <p>4.4 Хэрэглэгч үйлчилгээний төлбөрөө онлайнаар төлнө.</p>
              <p>
                4.5 ESAN-д байрласан контентуудын үнэ нь банкны төлбөрийн картын
                хураамж, НӨАТ багтсан эцсийн худалдаалах үнэ байна.
              </p>
              <p>
                4.6 Гадаадын банкны төлбөрийн картаар худалдан авалт хийгдэх үед
                төлбөл зохих дээрх дүн дээр тухайн картын хураамжийн хувь
                нэмэгдэнэ.
              </p>
              <h3>5. Гэрээ дуусгавар болох</h3>
              <p>
                5.1 Хэрэглэгч болон ESAN-ийн хооронд үүсэх аливаа харилцааг
                Монгол Улсын холбогдох хүчин төгөлдөр хууль, дүрэм, журмаар
                зохицуулах ба хэрэглэгч нь аливаа хууль бус үйл ажиллагаа
                явуулсан нотлогдсон буюу илэрсэн тохиолдолд ESAN нь ямар нэг
                хязгаарлалтгүйгээр тухайн хэрэглэгчид үйлчилгээ үзүүлэхээс
                татгалзах, бүртгэлийг хаах, захиалга цуцлах эрхтэй болно. Хууль
                бус үйл ажиллагаанаас учирсан хохирлыг хэрэглэгч бүрэн хариуцна.
              </p>
              <p>
                5.2 ESAN нь ямар ч үед Үйлчилгээ (эсвэл түүний аль нэг хэсгийг)
                түр буюу бүрмөсөн өөрчлөх буюу зогсоох эрхтэй. ESAN нь
                Үйлчилгээг өөрчлөх, түр зогсоох, цуцлах талаар хэрэглэгч болон
                аливаа гуравдагч этгээдийн өмнө аливаа үүрэг хүлээхгүй гэдгийг
                хэрэглэгч нь хүлээн зөвшөөрсөн болно.
              </p>
              <h3>
                <strong>6. Буцаалт</strong>
              </h3>
              <p>
                <strong>&nbsp;</strong>6.1 ESAN-с хийгдсэн бүх худалдан авалт,
                гишүүнчлэлийн суур хураамжны төлөлт эцсийнх бөгөөд төлбөр
                хийгдсэн тохиолдолд төлбөрийг бүтэн болон хэсэгчлэн буцаан
                олгохгүй болно.
              </p>
              <h3>
                <strong>7. Үйлчилгээний нөхцөлд орох өөрчлөлт</strong>
              </h3>
              <p>
                <strong>&nbsp;</strong>7.1 ESAN нь цаашид энэхүү Үйлчилгээний
                нөхцөлийн тодорхой заалтыг шууд хэрэгжих нөхцөлөөр өөрчлөх
                эрхтэй байна. Хэрэв Үйлчилгээний нөхцөлд аливаа өөрчлөлт орсон
                тохиолдолд танд тухайн өөрчлөлтийн талаар (аливаа өөрчлөлтийг
                хүчин төгөлдөр болохоос доод тал нь 2 долоо хоногийн өмнө) цаг
                тухайд нь имейлээр мэдээлнэ.
              </p>
              <p>
                7.2 ESAN нь тус Үйлчилгээний нөхцлийг ESAN дахь контент,
                Үйлчилгээтэй уялдуулахын тулд шинэчилж болно. Үйлчилгээний
                нөхцөлийн эхэнд тавигдсан шинэчилсэн огноог танд сүүлийн
                өөрчлөлтүүдийн огноог мэдэгдэхэд ашигладаг болно. Ийнхүү
                Үйлчилгээний нөхцөлийг шинэчилсний дараа та ESAN-д нэвтрэх буюу
                ашигласнаар тэдгээр өөрчлөлтийг хүлээн зөвшөөрсөн гэж үзнэ.
              </p>
              <p>
                7.3 ESAN нь платформ дээрх мэдээллийн шинэчлэл, үнийн өөрчлөлт,
                хөнгөлөлт, урамшуулал болон шинэ үйлчилгээний талаарх мэдээллийн
                үнэн зөвийг бүрэн хариуцна.
              </p>
              <h3>
                <strong>8. Холбоо барих</strong>
              </h3>
              <p>
                <strong>&nbsp;</strong>8.1 ESAN нь уншигч, гишүүдтэйгээ байнгын
                холбоотой байж, заавар зөвлөгөө өгч, тусламж үйлчилгээг цаг
                алдалгүй үзүүлж, ирсэн санал, хүсэлтийг хүлээн авч шийдвэрлэж
                байна.
              </p>
              <p>
                8.2 Хэрэглэгч болон контент нийлүүлэгчид ESAN болон веб сайтын
                талаар санал, гомдол, шинэ санаа, шинэ номын захиалга, шүүмж
                зэргийг чөлөөтэй илэрхийлэх, илгээх эрхтэй.
              </p>
              <p>
                8.3 Дараах мэдээллийн сувгаар худалдан авагч, гишүүдтэй
                холбогдож харилцана:
              </p>
              <ol>
                <li>7505 9911 суурин утсаар</li>
                <li>
                  <a href="https://www.facebook.com/esanlibrary22/">
                    https://www.facebook.com/esanlibrary22/
                  </a>
                  хуудсаар
                </li>
                <li>
                  <a href="mailto:contact@esan.mn">contact@esan.mn</a> имэйл
                  хаягаар
                </li>
              </ol>
            </div>
          </div>
        </div>
      </Col>
    </Row>
  </Container>
);

export default withLayout({ ssr: false })(Terms);
